code/Concurrency_Test_Snowflake_Public.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Concurrency Demo">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="BI Users" enabled="false">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">4</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree/>
      <com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup guiclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroupGui" testclass="com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup" testname="Concurrency Thread Group">
        <elementProp name="ThreadGroup.main_controller" elementType="com.blazemeter.jmeter.control.VirtualUserController"/>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="TargetLevel">100</stringProp>
        <stringProp name="RampUp">1</stringProp>
        <stringProp name="Steps">6</stringProp>
        <stringProp name="Hold">1</stringProp>
        <stringProp name="Unit">M</stringProp>
        <boolProp name="same_user_on_next_iteration">true</boolProp>
      </com.blazemeter.jmeter.threads.concurrency.ConcurrencyThreadGroup>
      <hashTree>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="BI Query Daily">
          <stringProp name="dataSource">biusers</stringProp>
          <stringProp name="query">-- TEST 1
WITH city_quarter_subcat AS (
  --Query 12
    SELECT
     current_timestamp() ts,
        l.city,
        DATE_TRUNC(&apos;quarter&apos;, f.order_date) AS sales_quarter,
        p.category,
        SUM(f.sales_total) AS total_sales
    FROM 
contoso_sales_2B f
    JOIN 
contoso_stores l
        ON f.store_id = l.store_id
    JOIN 
contoso_products p
        ON f.product_id = p.product_id
        AND f.order_date BETWEEN p.from_date AND p.to_date
    WHERE l.city IN (${MYFILTER})
      AND DATE_TRUNC(&apos;quarter&apos;, f.order_date) IN (
            DATE(&apos;2023-01-01&apos;), DATE(&apos;2023-04-01&apos;),
            DATE(&apos;2024-01-01&apos;), DATE(&apos;2024-04-01&apos;)
      )
    GROUP BY
        l.city,
        DATE_TRUNC(&apos;quarter&apos;, f.order_date),
        p.category
)
SELECT
current_timestamp() ts,
    city,
    sales_quarter,
    category,
    total_sales,
    RANK() OVER (PARTITION BY city, sales_quarter ORDER BY total_sales DESC) AS subcat_rank
FROM city_quarter_subcat
ORDER BY city, sales_quarter, subcat_rank;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="filters">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">/Users/nakincilar/Downloads/CITY_LIST.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">MYFILTER</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">biusers</stringProp>
          <stringProp name="dbUrl">jdbc:snowflake://&lt;your_acccount&gt;.snowflakecomputing.com/?user=QLIKUSER&amp;warehouse=DEMO_WH&amp;db=TEST&amp;schema=DATABRICKS&amp;password=&lt;Your_PAT_Token&gt;</stringProp>
          <stringProp name="driver">net.snowflake.client.jdbc.SnowflakeDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="poolMax">50</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <boolProp name="preinit">false</boolProp>
        </JDBCDataSource>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="RespTimeGraph.seriesselectionmatchlabel">10sec</stringProp>
        <intProp name="RespTimeGraph.linestrockwidth">5</intProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report - Max 2 clusters of Snow XS" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">JmeterLog.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">graph.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>